app/controllers/posts_controller.rb

  def edit
    @post = Post.find(params[:id])
    @post.build_thing unless @post.thing.present?
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
SELECT * FROM "things" WHERE ("things".post_id = 1) LIMIT 1

  def create
    @post = Post.new(params[:post])
    @post.build_thing unless @post.thing.present?
    template_format = params[:format] || 'erb'

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "title", "body", "published", "updated_at") VALUES('2009-10-08 22:58:55', '', 'dddd', 't', '2009-10-08 22:58:55')
INSERT INTO "things" ("name", "created_at", "updated_at", "post_id", "about") VALUES('wewe', '2009-10-11 20:37:32', '2009-10-11 20:37:32', 3, 'wewe')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "updated_at" = '2009-10-11 20:44:07', "title" = '34343433333' WHERE "id" = 4